// import {CardMovie} from './CardMovie'

const data1 = {
  srcImg: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1199596.jpg',
  alt: 'Гори, гори ясно',
  title: 'Гори, гори ясно',
  textDescription:
    'Что, если потерпевший крушение на Земле инопланетный ребенок со сверхспособностями вместо того, чтобы стать героем для человечества, окажется чем-то гораздо более зловещим?',
  textRange: 'IMDb: 6.60 (6688)',
};

const data2 = {
  srcImg: 'https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/080352b7-c2ab-454f-8ddd-756c4fc59fe8/orig',
  alt: 'Мулан',
  title: 'Мулан',
  textDescription:
    'Изданный императором Китая указ о призыве на службу в армии одного мужчины из каждой семьи для защиты страны от северных захватчиков вдохновляет Мулан, старшую дочь почетного воина, занять в войсках место больного отца. Одевшись мужчиной, девушка подвергается испытаниям на каждом шагу, проявляя свои внутреннюю силу и истинный потенциал.',
  textRange: 'IMDb: 5.70 (121K)',
};

const data3 = {
  srcImg: 'https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/78c36c0f-aefd-4102-bc3b-bac0dd4314d8/orig',
  alt: 'Интерстеллар',
  title: 'Интерстеллар',
  textDescription:
    'Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями',
  textRange: 'IMDb: 8.60 (1 556K)',
};

const data4 = {
  srcImg: 'https://avatars.mds.yandex.net/get-kinopoisk-image/1773646/4a7e0b70-5f46-46d2-b5b6-85b595e78fe5/orig',
  alt: 'Властелин колец: Братство Кольца',
  title: 'Властелин колец: Братство Кольца',
  textDescription:
    'Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад',
  textRange: 'IMDb: 8.80 (1 692K)',
};

export const arrMovies = [data1, data2, data3, data4];
