// import {CardMovie} from './CardMovie'

const data1 = {
  srcImg: 'https://kino-teatr.ua/public/main/films/poster_5be67fa14676c.jpg',
  alt: 'Гарри Поттер и философский камень',
  title: 'Гарри Поттер и философский камень',
  textDescription:
    'Жизнь десятилетнего Гарри Поттера нельзя назвать сладкой: родители умерли, едва ему исполнился год, а от дяди и тёти, взявших сироту на воспитание, достаются лишь тычки да подзатыльники. Но в одиннадцатый день рождения Гарри всё меняется. Странный гость, неожиданно появившийся на пороге, приносит письмо, из которого мальчик узнаёт, что на самом деле он - волшебник и зачислен в школу магии под названием Хогвартс.',
  textRange: 'IMDb: 7.60 (674K)',
};

const data2 = {
  srcImg: 'https://kino-teatr.ua/public/main/films/poster_7069.jpg',
  alt: 'Голодные игры',
  title: 'Голодные игры',
  textDescription:
    'Будущее. Деспотичное государство ежегодно устраивает показательные игры на выживание, за которыми в прямом эфире следит весь мир. Жребий участвовать в Играх выпадает юной Китнисс и тайно влюбленному в нее Питу. Они знакомы с детства, но теперь должны стать врагами. Ведь по нерушимому закону Голодных игр победить может только один из 24 участников. Судьям не важно кто выиграет, главное - зрелище. И на этот раз зрелище будет незабываемым.',
  textRange: 'IMDb: 7.20 (855K)',
};

const data3 = {
  srcImg: 'https://kino-teatr.ua/public/main/films/poster_543fa33259eb2.jpg',
  alt: 'Интерстеллар',
  title: 'Интерстеллар',
  textDescription:
    'Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.',
  textRange: 'IMDb: 8.60 (1 556K)',
};

const data4 = {
  srcImg: 'https://kino-teatr.ua/public/main/films/poster_46936.jpg',
  alt: 'Властелин колец: Братство Кольца',
  title: 'Властелин колец: Братство Кольца',
  textDescription:
    'Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад.',
  textRange: 'IMDb: 8.80 (1 692K)',
};

export const arrMovies = [data1, data2, data3, data4];
